{
  "architectures": [
    "MllamaForConditionalGeneration"
  ],
  "dtype": "float16",
  "image_token_index": 128256,
  "model_type": "mllama",
  "text_config": {
    "_attn_implementation_autoset": false,
    "add_cross_attention": false,
    "bos_token_id": 128000,
    "cross_attention_hidden_size": null,
    "cross_attention_layers": [
      3,
      8,
      13,
      18,
      23,
      28,
      33,
      38
    ],
    "decoder_start_token_id": null,
    "dropout": 0,
    "dtype": "float16",
    "eos_token_id": [
      128001,
      128008,
      128009
    ],
    "finetuning_task": null,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 14336,
    "is_decoder": false,
    "max_position_embeddings": 131072,
    "model_type": "mllama_text_model",
    "num_attention_heads": 32,
    "num_hidden_layers": 40,
    "num_key_value_heads": 8,
    "pad_token_id": 128004,
    "prefix": null,
    "pruned_heads": {},
    "rms_norm_eps": 1e-05,
    "rope_parameters": {
      "factor": 8.0,
      "high_freq_factor": 4.0,
      "low_freq_factor": 1.0,
      "original_max_position_embeddings": 8192,
      "rope_theta": 500000.0,
      "rope_type": "llama3"
    },
    "sep_token_id": null,
    "task_specific_params": null,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": false,
    "tokenizer_class": null,
    "torchscript": false,
    "use_bfloat16": false,
    "use_cache": true,
    "vocab_size": 128256
  },
  "transformers_version": "5.1.0",
  "unsloth_fixed": true,
  "vision_config": {
    "_attn_implementation_autoset": false,
    "add_cross_attention": false,
    "attention_heads": 16,
    "bos_token_id": null,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "dtype": "float16",
    "eos_token_id": null,
    "finetuning_task": null,
    "hidden_act": "gelu",
    "hidden_size": 1280,
    "image_size": 560,
    "initializer_range": 0.02,
    "intermediate_layers_indices": [
      3,
      7,
      15,
      23,
      30
    ],
    "intermediate_size": 5120,
    "is_decoder": false,
    "max_num_tiles": 4,
    "model_type": "mllama_vision_model",
    "norm_eps": 1e-05,
    "num_channels": 3,
    "num_global_layers": 8,
    "num_hidden_layers": 32,
    "pad_token_id": null,
    "patch_size": 14,
    "prefix": null,
    "pruned_heads": {},
    "sep_token_id": null,
    "supported_aspect_ratios": [
      [
        1,
        1
      ],
      [
        1,
        2
      ],
      [
        1,
        3
      ],
      [
        1,
        4
      ],
      [
        2,
        1
      ],
      [
        2,
        2
      ],
      [
        3,
        1
      ],
      [
        4,
        1
      ]
    ],
    "task_specific_params": null,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "torchscript": false,
    "use_bfloat16": false,
    "vision_output_dim": 7680
  }
}
