{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "unsloth/Llama-3.2-11B-Vision-Instruct-bnb-4bit",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "model.layers.12.self_attn.v_proj",
    "model.layers.11.self_attn.o_proj",
    "model.layers.9.self_attn.v_proj",
    "model.layers.2.self_attn.q_proj",
    "model.layers.1.self_attn.k_proj",
    "model.layers.0.self_attn.v_proj",
    "model.layers.21.self_attn.q_proj",
    "34.self_attn.k_proj",
    "model.layers.11.self_attn.q_proj",
    "model.layers.19.self_attn.q_proj",
    "model.layers.2.self_attn.v_proj",
    "model.layers.29.self_attn.q_proj",
    "model.layers.0.self_attn.o_proj",
    "36.self_attn.q_proj",
    "model.layers.6.self_attn.v_proj",
    "model.layers.16.self_attn.q_proj",
    "model.layers.9.self_attn.o_proj",
    "model.layers.5.self_attn.k_proj",
    "model.layers.21.self_attn.k_proj",
    "model.layers.27.self_attn.o_proj",
    "model.layers.4.self_attn.k_proj",
    "32.self_attn.v_proj",
    "model.layers.10.self_attn.o_proj",
    "model.layers.6.self_attn.q_proj",
    "model.layers.26.self_attn.v_proj",
    "model.layers.2.self_attn.o_proj",
    "35.self_attn.v_proj",
    "36.self_attn.v_proj",
    "35.self_attn.k_proj",
    "model.layers.29.self_attn.k_proj",
    "model.layers.20.self_attn.k_proj",
    "35.self_attn.q_proj",
    "model.layers.30.self_attn.v_proj",
    "model.layers.25.self_attn.v_proj",
    "model.layers.20.self_attn.v_proj",
    "model.layers.20.self_attn.o_proj",
    "model.layers.0.self_attn.k_proj",
    "35.self_attn.o_proj",
    "model.layers.27.self_attn.q_proj",
    "37.self_attn.k_proj",
    "model.layers.29.self_attn.o_proj",
    "32.self_attn.k_proj",
    "model.layers.17.self_attn.v_proj",
    "model.layers.31.self_attn.k_proj",
    "model.layers.15.self_attn.q_proj",
    "cross_attn.k_proj",
    "model.layers.9.self_attn.k_proj",
    "39.self_attn.k_proj",
    "model.layers.24.self_attn.v_proj",
    "model.layers.12.self_attn.q_proj",
    "model.layers.22.self_attn.v_proj",
    "model.layers.1.self_attn.o_proj",
    "model.layers.4.self_attn.v_proj",
    "model.layers.19.self_attn.o_proj",
    "model.layers.20.self_attn.q_proj",
    "model.layers.24.self_attn.k_proj",
    "model.layers.27.self_attn.k_proj",
    "model.layers.12.self_attn.o_proj",
    "model.layers.25.self_attn.k_proj",
    "36.self_attn.k_proj",
    "model.layers.15.self_attn.v_proj",
    "model.layers.14.self_attn.o_proj",
    "model.layers.16.self_attn.o_proj",
    "model.layers.4.self_attn.q_proj",
    "model.layers.29.self_attn.v_proj",
    "model.layers.22.self_attn.k_proj",
    "model.layers.19.self_attn.k_proj",
    "model.layers.7.self_attn.o_proj",
    "model.layers.25.self_attn.o_proj",
    "model.layers.24.self_attn.o_proj",
    "34.self_attn.v_proj",
    "36.self_attn.o_proj",
    "model.layers.17.self_attn.k_proj",
    "37.self_attn.q_proj",
    "model.layers.7.self_attn.v_proj",
    "model.layers.1.self_attn.v_proj",
    "32.self_attn.q_proj",
    "model.layers.2.self_attn.k_proj",
    "model.layers.31.self_attn.o_proj",
    "model.layers.14.self_attn.k_proj",
    "model.layers.4.self_attn.o_proj",
    "model.layers.15.self_attn.k_proj",
    "model.layers.30.self_attn.q_proj",
    "model.layers.17.self_attn.q_proj",
    "up_proj",
    "39.self_attn.v_proj",
    "model.layers.11.self_attn.k_proj",
    "model.layers.5.self_attn.o_proj",
    "model.layers.11.self_attn.v_proj",
    "model.layers.1.self_attn.q_proj",
    "cross_attn.q_proj",
    "model.layers.14.self_attn.v_proj",
    "model.layers.10.self_attn.q_proj",
    "model.layers.26.self_attn.o_proj",
    "model.layers.30.self_attn.o_proj",
    "model.layers.25.self_attn.q_proj",
    "model.layers.7.self_attn.q_proj",
    "model.layers.14.self_attn.q_proj",
    "model.layers.6.self_attn.k_proj",
    "cross_attn.v_proj",
    "cross_attn.o_proj",
    "model.layers.31.self_attn.q_proj",
    "model.layers.26.self_attn.k_proj",
    "model.layers.22.self_attn.o_proj",
    "gate_proj",
    "model.layers.24.self_attn.q_proj",
    "model.layers.9.self_attn.q_proj",
    "39.self_attn.q_proj",
    "model.layers.7.self_attn.k_proj",
    "model.layers.17.self_attn.o_proj",
    "34.self_attn.o_proj",
    "model.layers.16.self_attn.v_proj",
    "model.layers.31.self_attn.v_proj",
    "model.layers.6.self_attn.o_proj",
    "model.layers.26.self_attn.q_proj",
    "model.layers.21.self_attn.v_proj",
    "model.layers.22.self_attn.q_proj",
    "model.layers.19.self_attn.v_proj",
    "model.layers.5.self_attn.v_proj",
    "model.layers.16.self_attn.k_proj",
    "32.self_attn.o_proj",
    "model.layers.12.self_attn.k_proj",
    "37.self_attn.v_proj",
    "down_proj",
    "39.self_attn.o_proj",
    "37.self_attn.o_proj",
    "model.layers.21.self_attn.o_proj",
    "model.layers.30.self_attn.k_proj",
    "model.layers.10.self_attn.v_proj",
    "model.layers.10.self_attn.k_proj",
    "model.layers.0.self_attn.q_proj",
    "34.self_attn.q_proj",
    "model.layers.5.self_attn.q_proj",
    "model.layers.27.self_attn.v_proj",
    "model.layers.15.self_attn.o_proj"
  ],
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}