{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "unsloth/Llama-3.2-90B-Vision-Instruct-bnb-4bit",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "model.layers.15.self_attn.v_proj",
    "91.self_attn.o_proj",
    "model.layers.10.self_attn.q_proj",
    "62.self_attn.k_proj",
    "model.layers.6.self_attn.o_proj",
    "49.self_attn.q_proj",
    "model.layers.31.self_attn.k_proj",
    "34.self_attn.q_proj",
    "59.self_attn.q_proj",
    "86.self_attn.v_proj",
    "34.self_attn.o_proj",
    "34.self_attn.v_proj",
    "cross_attn.q_proj",
    "54.self_attn.v_proj",
    "44.self_attn.o_proj",
    "80.self_attn.v_proj",
    "80.self_attn.q_proj",
    "94.self_attn.q_proj",
    "95.self_attn.v_proj",
    "model.layers.27.self_attn.o_proj",
    "66.self_attn.o_proj",
    "model.layers.16.self_attn.v_proj",
    "90.self_attn.q_proj",
    "69.self_attn.v_proj",
    "94.self_attn.o_proj",
    "77.self_attn.q_proj",
    "62.self_attn.o_proj",
    "32.self_attn.q_proj",
    "82.self_attn.v_proj",
    "62.self_attn.v_proj",
    "81.self_attn.k_proj",
    "97.self_attn.q_proj",
    "74.self_attn.k_proj",
    "79.self_attn.q_proj",
    "66.self_attn.v_proj",
    "52.self_attn.q_proj",
    "97.self_attn.k_proj",
    "41.self_attn.o_proj",
    "model.layers.24.self_attn.q_proj",
    "99.self_attn.v_proj",
    "model.layers.20.self_attn.k_proj",
    "52.self_attn.v_proj",
    "model.layers.5.self_attn.v_proj",
    "model.layers.17.self_attn.o_proj",
    "46.self_attn.o_proj",
    "37.self_attn.o_proj",
    "model.layers.29.self_attn.v_proj",
    "39.self_attn.k_proj",
    "77.self_attn.v_proj",
    "36.self_attn.o_proj",
    "84.self_attn.k_proj",
    "model.layers.7.self_attn.o_proj",
    "40.self_attn.v_proj",
    "91.self_attn.q_proj",
    "64.self_attn.v_proj",
    "model.layers.9.self_attn.k_proj",
    "75.self_attn.v_proj",
    "model.layers.30.self_attn.k_proj",
    "57.self_attn.o_proj",
    "57.self_attn.v_proj",
    "model.layers.9.self_attn.o_proj",
    "model.layers.30.self_attn.o_proj",
    "49.self_attn.v_proj",
    "67.self_attn.q_proj",
    "model.layers.14.self_attn.o_proj",
    "92.self_attn.q_proj",
    "cross_attn.k_proj",
    "92.self_attn.o_proj",
    "40.self_attn.o_proj",
    "81.self_attn.v_proj",
    "45.self_attn.q_proj",
    "model.layers.29.self_attn.q_proj",
    "model.layers.22.self_attn.q_proj",
    "model.layers.22.self_attn.o_proj",
    "cross_attn.v_proj",
    "model.layers.26.self_attn.q_proj",
    "66.self_attn.k_proj",
    "model.layers.21.self_attn.q_proj",
    "40.self_attn.q_proj",
    "96.self_attn.q_proj",
    "76.self_attn.q_proj",
    "80.self_attn.k_proj",
    "39.self_attn.o_proj",
    "up_proj",
    "95.self_attn.q_proj",
    "71.self_attn.v_proj",
    "60.self_attn.v_proj",
    "70.self_attn.o_proj",
    "down_proj",
    "model.layers.12.self_attn.k_proj",
    "77.self_attn.k_proj",
    "cross_attn.o_proj",
    "86.self_attn.q_proj",
    "89.self_attn.q_proj",
    "model.layers.5.self_attn.q_proj",
    "59.self_attn.k_proj",
    "61.self_attn.q_proj",
    "56.self_attn.v_proj",
    "model.layers.19.self_attn.o_proj",
    "89.self_attn.k_proj",
    "42.self_attn.v_proj",
    "74.self_attn.q_proj",
    "74.self_attn.v_proj",
    "model.layers.11.self_attn.v_proj",
    "61.self_attn.v_proj",
    "64.self_attn.q_proj",
    "model.layers.24.self_attn.o_proj",
    "85.self_attn.o_proj",
    "model.layers.31.self_attn.v_proj",
    "76.self_attn.k_proj",
    "model.layers.24.self_attn.k_proj",
    "60.self_attn.o_proj",
    "model.layers.24.self_attn.v_proj",
    "model.layers.14.self_attn.v_proj",
    "35.self_attn.k_proj",
    "55.self_attn.v_proj",
    "46.self_attn.k_proj",
    "47.self_attn.v_proj",
    "model.layers.30.self_attn.q_proj",
    "60.self_attn.k_proj",
    "85.self_attn.q_proj",
    "51.self_attn.v_proj",
    "44.self_attn.v_proj",
    "60.self_attn.q_proj",
    "model.layers.11.self_attn.o_proj",
    "61.self_attn.o_proj",
    "89.self_attn.v_proj",
    "model.layers.12.self_attn.q_proj",
    "50.self_attn.k_proj",
    "model.layers.17.self_attn.k_proj",
    "model.layers.0.self_attn.v_proj",
    "91.self_attn.k_proj",
    "model.layers.26.self_attn.v_proj",
    "model.layers.25.self_attn.v_proj",
    "65.self_attn.o_proj",
    "67.self_attn.v_proj",
    "65.self_attn.q_proj",
    "model.layers.26.self_attn.k_proj",
    "67.self_attn.k_proj",
    "model.layers.2.self_attn.o_proj",
    "69.self_attn.o_proj",
    "model.layers.15.self_attn.k_proj",
    "90.self_attn.v_proj",
    "94.self_attn.v_proj",
    "model.layers.0.self_attn.q_proj",
    "model.layers.10.self_attn.k_proj",
    "59.self_attn.v_proj",
    "model.layers.20.self_attn.o_proj",
    "49.self_attn.o_proj",
    "55.self_attn.o_proj",
    "76.self_attn.o_proj",
    "51.self_attn.q_proj",
    "89.self_attn.o_proj",
    "model.layers.7.self_attn.q_proj",
    "57.self_attn.k_proj",
    "44.self_attn.k_proj",
    "model.layers.19.self_attn.v_proj",
    "95.self_attn.k_proj",
    "50.self_attn.v_proj",
    "45.self_attn.o_proj",
    "model.layers.10.self_attn.v_proj",
    "82.self_attn.k_proj",
    "model.layers.10.self_attn.o_proj",
    "model.layers.29.self_attn.k_proj",
    "72.self_attn.o_proj",
    "90.self_attn.k_proj",
    "model.layers.21.self_attn.o_proj",
    "model.layers.4.self_attn.q_proj",
    "model.layers.0.self_attn.o_proj",
    "47.self_attn.k_proj",
    "model.layers.16.self_attn.k_proj",
    "82.self_attn.o_proj",
    "36.self_attn.k_proj",
    "84.self_attn.o_proj",
    "model.layers.29.self_attn.o_proj",
    "32.self_attn.k_proj",
    "64.self_attn.k_proj",
    "model.layers.31.self_attn.q_proj",
    "86.self_attn.o_proj",
    "99.self_attn.o_proj",
    "44.self_attn.q_proj",
    "model.layers.20.self_attn.q_proj",
    "model.layers.9.self_attn.q_proj",
    "51.self_attn.k_proj",
    "75.self_attn.q_proj",
    "64.self_attn.o_proj",
    "72.self_attn.k_proj",
    "66.self_attn.q_proj",
    "model.layers.15.self_attn.o_proj",
    "model.layers.12.self_attn.v_proj",
    "36.self_attn.q_proj",
    "54.self_attn.o_proj",
    "model.layers.4.self_attn.v_proj",
    "34.self_attn.k_proj",
    "69.self_attn.k_proj",
    "91.self_attn.v_proj",
    "97.self_attn.o_proj",
    "41.self_attn.k_proj",
    "96.self_attn.o_proj",
    "model.layers.19.self_attn.q_proj",
    "model.layers.9.self_attn.v_proj",
    "model.layers.14.self_attn.q_proj",
    "32.self_attn.o_proj",
    "model.layers.30.self_attn.v_proj",
    "model.layers.7.self_attn.v_proj",
    "62.self_attn.q_proj",
    "65.self_attn.k_proj",
    "model.layers.21.self_attn.v_proj",
    "79.self_attn.o_proj",
    "51.self_attn.o_proj",
    "model.layers.16.self_attn.o_proj",
    "model.layers.17.self_attn.q_proj",
    "45.self_attn.k_proj",
    "56.self_attn.o_proj",
    "model.layers.7.self_attn.k_proj",
    "37.self_attn.k_proj",
    "model.layers.21.self_attn.k_proj",
    "model.layers.6.self_attn.k_proj",
    "50.self_attn.o_proj",
    "model.layers.1.self_attn.q_proj",
    "94.self_attn.k_proj",
    "model.layers.16.self_attn.q_proj",
    "model.layers.1.self_attn.v_proj",
    "54.self_attn.k_proj",
    "model.layers.5.self_attn.k_proj",
    "96.self_attn.v_proj",
    "84.self_attn.v_proj",
    "87.self_attn.q_proj",
    "96.self_attn.k_proj",
    "85.self_attn.v_proj",
    "70.self_attn.k_proj",
    "71.self_attn.q_proj",
    "80.self_attn.o_proj",
    "42.self_attn.q_proj",
    "57.self_attn.q_proj",
    "model.layers.11.self_attn.q_proj",
    "79.self_attn.v_proj",
    "model.layers.15.self_attn.q_proj",
    "41.self_attn.v_proj",
    "72.self_attn.v_proj",
    "40.self_attn.k_proj",
    "77.self_attn.o_proj",
    "69.self_attn.q_proj",
    "model.layers.27.self_attn.k_proj",
    "97.self_attn.v_proj",
    "model.layers.25.self_attn.q_proj",
    "74.self_attn.o_proj",
    "55.self_attn.q_proj",
    "36.self_attn.v_proj",
    "65.self_attn.v_proj",
    "model.layers.20.self_attn.v_proj",
    "87.self_attn.k_proj",
    "54.self_attn.q_proj",
    "model.layers.26.self_attn.o_proj",
    "model.layers.11.self_attn.k_proj",
    "72.self_attn.q_proj",
    "75.self_attn.o_proj",
    "95.self_attn.o_proj",
    "84.self_attn.q_proj",
    "model.layers.1.self_attn.k_proj",
    "39.self_attn.v_proj",
    "49.self_attn.k_proj",
    "35.self_attn.v_proj",
    "model.layers.1.self_attn.o_proj",
    "model.layers.17.self_attn.v_proj",
    "99.self_attn.k_proj",
    "56.self_attn.k_proj",
    "35.self_attn.o_proj",
    "model.layers.6.self_attn.q_proj",
    "model.layers.22.self_attn.k_proj",
    "92.self_attn.k_proj",
    "model.layers.25.self_attn.o_proj",
    "75.self_attn.k_proj",
    "47.self_attn.q_proj",
    "model.layers.5.self_attn.o_proj",
    "model.layers.19.self_attn.k_proj",
    "50.self_attn.q_proj",
    "82.self_attn.q_proj",
    "39.self_attn.q_proj",
    "35.self_attn.q_proj",
    "67.self_attn.o_proj",
    "model.layers.2.self_attn.v_proj",
    "90.self_attn.o_proj",
    "87.self_attn.v_proj",
    "81.self_attn.q_proj",
    "92.self_attn.v_proj",
    "32.self_attn.v_proj",
    "42.self_attn.k_proj",
    "model.layers.27.self_attn.q_proj",
    "gate_proj",
    "99.self_attn.q_proj",
    "37.self_attn.q_proj",
    "model.layers.2.self_attn.q_proj",
    "85.self_attn.k_proj",
    "model.layers.14.self_attn.k_proj",
    "model.layers.2.self_attn.k_proj",
    "81.self_attn.o_proj",
    "46.self_attn.v_proj",
    "model.layers.12.self_attn.o_proj",
    "59.self_attn.o_proj",
    "76.self_attn.v_proj",
    "47.self_attn.o_proj",
    "86.self_attn.k_proj",
    "41.self_attn.q_proj",
    "70.self_attn.q_proj",
    "model.layers.27.self_attn.v_proj",
    "45.self_attn.v_proj",
    "model.layers.25.self_attn.k_proj",
    "46.self_attn.q_proj",
    "87.self_attn.o_proj",
    "70.self_attn.v_proj",
    "79.self_attn.k_proj",
    "71.self_attn.o_proj",
    "56.self_attn.q_proj",
    "37.self_attn.v_proj",
    "model.layers.4.self_attn.o_proj",
    "71.self_attn.k_proj",
    "61.self_attn.k_proj",
    "model.layers.6.self_attn.v_proj",
    "model.layers.31.self_attn.o_proj",
    "model.layers.0.self_attn.k_proj",
    "52.self_attn.o_proj",
    "55.self_attn.k_proj",
    "model.layers.22.self_attn.v_proj",
    "42.self_attn.o_proj",
    "model.layers.4.self_attn.k_proj",
    "52.self_attn.k_proj"
  ],
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}