{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "unsloth/Qwen2.5-VL-72B-Instruct-bnb-4bit",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "65.mlp.down_proj",
    "layers.17.mlp.down_proj",
    "67.mlp.gate_proj",
    "32.mlp.up_proj",
    "layers.29.mlp.gate_proj",
    "35.mlp.up_proj",
    "layers.26.mlp.down_proj",
    "74.mlp.down_proj",
    "layers.4.mlp.down_proj",
    "47.mlp.down_proj",
    "o_proj",
    "42.mlp.up_proj",
    "52.mlp.gate_proj",
    "layers.25.mlp.up_proj",
    "48.mlp.down_proj",
    "59.mlp.gate_proj",
    "layers.2.mlp.down_proj",
    "layers.9.mlp.down_proj",
    "44.mlp.up_proj",
    "53.mlp.gate_proj",
    "50.mlp.gate_proj",
    "layers.26.mlp.gate_proj",
    "43.mlp.down_proj",
    "53.mlp.down_proj",
    "64.mlp.up_proj",
    "72.mlp.gate_proj",
    "68.mlp.down_proj",
    "layers.20.mlp.down_proj",
    "layers.28.mlp.up_proj",
    "44.mlp.down_proj",
    "75.mlp.down_proj",
    "67.mlp.down_proj",
    "57.mlp.gate_proj",
    "40.mlp.up_proj",
    "44.mlp.gate_proj",
    "65.mlp.up_proj",
    "layers.16.mlp.gate_proj",
    "79.mlp.gate_proj",
    "49.mlp.down_proj",
    "63.mlp.gate_proj",
    "37.mlp.down_proj",
    "35.mlp.gate_proj",
    "32.mlp.down_proj",
    "69.mlp.gate_proj",
    "38.mlp.gate_proj",
    "layers.8.mlp.up_proj",
    "layers.6.mlp.gate_proj",
    "layers.20.mlp.up_proj",
    "77.mlp.down_proj",
    "56.mlp.down_proj",
    "55.mlp.down_proj",
    "layers.12.mlp.down_proj",
    "34.mlp.down_proj",
    "70.mlp.down_proj",
    "43.mlp.up_proj",
    "k_proj",
    "layers.25.mlp.gate_proj",
    "45.mlp.up_proj",
    "54.mlp.gate_proj",
    "57.mlp.down_proj",
    "71.mlp.up_proj",
    "51.mlp.gate_proj",
    "layers.14.mlp.up_proj",
    "layers.19.mlp.up_proj",
    "46.mlp.gate_proj",
    "76.mlp.gate_proj",
    "36.mlp.gate_proj",
    "47.mlp.gate_proj",
    "35.mlp.down_proj",
    "77.mlp.gate_proj",
    "layers.1.mlp.up_proj",
    "52.mlp.up_proj",
    "76.mlp.up_proj",
    "71.mlp.gate_proj",
    "layers.4.mlp.up_proj",
    "layers.17.mlp.gate_proj",
    "layers.18.mlp.gate_proj",
    "41.mlp.gate_proj",
    "layers.7.mlp.gate_proj",
    "38.mlp.down_proj",
    "layers.19.mlp.gate_proj",
    "layers.15.mlp.up_proj",
    "48.mlp.up_proj",
    "v_proj",
    "layers.16.mlp.down_proj",
    "layers.11.mlp.up_proj",
    "layers.12.mlp.up_proj",
    "46.mlp.down_proj",
    "40.mlp.down_proj",
    "layers.3.mlp.gate_proj",
    "74.mlp.up_proj",
    "34.mlp.gate_proj",
    "layers.8.mlp.gate_proj",
    "38.mlp.up_proj",
    "53.mlp.up_proj",
    "layers.0.mlp.gate_proj",
    "72.mlp.up_proj",
    "43.mlp.gate_proj",
    "61.mlp.gate_proj",
    "46.mlp.up_proj",
    "layers.4.mlp.gate_proj",
    "49.mlp.up_proj",
    "73.mlp.gate_proj",
    "layers.31.mlp.gate_proj",
    "layers.30.mlp.gate_proj",
    "70.mlp.up_proj",
    "70.mlp.gate_proj",
    "41.mlp.down_proj",
    "58.mlp.up_proj",
    "layers.6.mlp.down_proj",
    "76.mlp.down_proj",
    "61.mlp.up_proj",
    "layers.20.mlp.gate_proj",
    "layers.0.mlp.down_proj",
    "layers.3.mlp.up_proj",
    "40.mlp.gate_proj",
    "62.mlp.gate_proj",
    "layers.21.mlp.down_proj",
    "layers.18.mlp.down_proj",
    "layers.22.mlp.gate_proj",
    "layers.23.mlp.down_proj",
    "59.mlp.down_proj",
    "39.mlp.gate_proj",
    "layers.21.mlp.up_proj",
    "41.mlp.up_proj",
    "49.mlp.gate_proj",
    "33.mlp.up_proj",
    "63.mlp.up_proj",
    "51.mlp.down_proj",
    "66.mlp.up_proj",
    "48.mlp.gate_proj",
    "42.mlp.down_proj",
    "72.mlp.down_proj",
    "layers.15.mlp.down_proj",
    "layers.31.mlp.down_proj",
    "33.mlp.down_proj",
    "78.mlp.down_proj",
    "layers.27.mlp.gate_proj",
    "62.mlp.up_proj",
    "67.mlp.up_proj",
    "layers.17.mlp.up_proj",
    "layers.28.mlp.down_proj",
    "54.mlp.down_proj",
    "73.mlp.up_proj",
    "50.mlp.down_proj",
    "layers.27.mlp.up_proj",
    "71.mlp.down_proj",
    "layers.3.mlp.down_proj",
    "layers.29.mlp.down_proj",
    "56.mlp.up_proj",
    "layers.11.mlp.down_proj",
    "layers.14.mlp.down_proj",
    "layers.28.mlp.gate_proj",
    "60.mlp.gate_proj",
    "layers.30.mlp.up_proj",
    "62.mlp.down_proj",
    "77.mlp.up_proj",
    "58.mlp.down_proj",
    "layers.16.mlp.up_proj",
    "layers.31.mlp.up_proj",
    "66.mlp.down_proj",
    "layers.14.mlp.gate_proj",
    "68.mlp.gate_proj",
    "layers.18.mlp.up_proj",
    "57.mlp.up_proj",
    "64.mlp.down_proj",
    "78.mlp.up_proj",
    "layers.10.mlp.up_proj",
    "layers.10.mlp.gate_proj",
    "78.mlp.gate_proj",
    "layers.24.mlp.gate_proj",
    "layers.9.mlp.gate_proj",
    "73.mlp.down_proj",
    "layers.24.mlp.up_proj",
    "55.mlp.up_proj",
    "36.mlp.up_proj",
    "layers.22.mlp.up_proj",
    "79.mlp.up_proj",
    "39.mlp.down_proj",
    "63.mlp.down_proj",
    "layers.1.mlp.down_proj",
    "layers.8.mlp.down_proj",
    "39.mlp.up_proj",
    "layers.13.mlp.gate_proj",
    "layers.25.mlp.down_proj",
    "layers.15.mlp.gate_proj",
    "layers.29.mlp.up_proj",
    "51.mlp.up_proj",
    "36.mlp.down_proj",
    "32.mlp.gate_proj",
    "56.mlp.gate_proj",
    "75.mlp.gate_proj",
    "75.mlp.up_proj",
    "74.mlp.gate_proj",
    "61.mlp.down_proj",
    "layers.26.mlp.up_proj",
    "60.mlp.up_proj",
    "layers.9.mlp.up_proj",
    "layers.12.mlp.gate_proj",
    "layers.23.mlp.up_proj",
    "37.mlp.gate_proj",
    "65.mlp.gate_proj",
    "q_proj",
    "69.mlp.down_proj",
    "58.mlp.gate_proj",
    "layers.24.mlp.down_proj",
    "54.mlp.up_proj",
    "layers.2.mlp.up_proj",
    "50.mlp.up_proj",
    "layers.22.mlp.down_proj",
    "42.mlp.gate_proj",
    "34.mlp.up_proj",
    "layers.5.mlp.gate_proj",
    "47.mlp.up_proj",
    "layers.1.mlp.gate_proj",
    "68.mlp.up_proj",
    "layers.11.mlp.gate_proj",
    "66.mlp.gate_proj",
    "layers.5.mlp.up_proj",
    "layers.10.mlp.down_proj",
    "layers.6.mlp.up_proj",
    "79.mlp.down_proj",
    "45.mlp.gate_proj",
    "33.mlp.gate_proj",
    "60.mlp.down_proj",
    "69.mlp.up_proj",
    "layers.5.mlp.down_proj",
    "layers.2.mlp.gate_proj",
    "layers.13.mlp.up_proj",
    "layers.19.mlp.down_proj",
    "layers.7.mlp.up_proj",
    "layers.23.mlp.gate_proj",
    "64.mlp.gate_proj",
    "layers.27.mlp.down_proj",
    "layers.30.mlp.down_proj",
    "52.mlp.down_proj",
    "layers.7.mlp.down_proj",
    "layers.13.mlp.down_proj",
    "layers.21.mlp.gate_proj",
    "55.mlp.gate_proj",
    "layers.0.mlp.up_proj",
    "37.mlp.up_proj",
    "45.mlp.down_proj",
    "59.mlp.up_proj"
  ],
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}